Revit 2027 API
StairsRunType.TreadThickness Property
 The thickness of the treads.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double TreadThickness { get; set; }
Public Property TreadThickness As Double
	Get
	Set
public:
property double TreadThickness {
	double get ();
	void set (double value);
}
member TreadThickness : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for thickness must be greater than 0 and no more than 30000 feet.
InvalidOperationException |  When setting this property: The run type has no tread so the data being set is not applicable.
See Also
Reference
StairsRunType Class
Autodesk.Revit.DB.Architecture Namespace